validationAndVerificationSuite/validation/incompressible/simpleFoam/backwardFacingStep/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=simpleFoam

runApplication blockMesh
runApplication potentialFoam
runApplication $application
runApplication sample -latestTime

timeStep=$(grep "^endTime" system/controlDict | awk '{ print $2 }' | sed 's/;//g')

cp -v surfaces/$timeStep/p_lowerWall.raw validationData/
cp -v sets/$timeStep/profile_?_U.xy validationData/

./validationData/gnuplot

mkdir -v validationResults

mv -v *.png validationResults/

cp -v validationData/BFSLines.pdf validationResults/

gnome-open validationResults/Cp.png
