validationAndVerificationSuite/validation/incompressible/simpleFoam/backwardFacingStep/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;//0.0127;

vertices
(
    (-110 9 0)
    (-110 1 0)
    (0 1 0)
    (0 0 0)
    (50 0 0)
    (50 1 0)
    (50 9 0)
    (0 9 0)

    (-110 9 1)
    (-110 1 1)
    (0 1 1)
    (0 0 1)
    (50 0 1)
    (50 1 1)
    (50 9 1)
    (0 9 1)

    (-130 9 0)
    (-130 1 0)

    (-130 9 1)
    (-130 1 1)
);

blocks
(
    hex (17 1 0 16 19 9 8 18) (15 45 1) simpleGrading (0.85925 7.95 1) //(100 40 1)
    hex (1 2 7 0 9 10 15 8) (262 45 1) simpleGrading (0.04368 7.95 1) //(550 40 1)
    hex (2 5 6 7 10 13 14 15) (330 45 1) simpleGrading (5.1341 7.95 1) //(250 40 1)
    hex (3 4 5 2 11 12 13 10) (330 19 1) simpleGrading (5.1341 1 1) //(250 10 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (16 17 19 18)
    )
    patch outlet
    (
        (5 6 14 13)
        (4 5 13 12)

    )
    patch symmetry
    (
        (0 16 18 8)
        (1 9 19 17)

    )
    wall upperWall
    (
        (0 8 15 7)
        (7 15 14 6)
    )
    wall lowerWall
    (
        (1 9 10 2)
        (2 10 11 3)
        (3 11 12 4)
    )
    empty frontAndBack
    (
        (0 7 2 1)
        (2 7 6 5)
        (2 5 4 3)
        (8 9 10 15)
        (10 13 14 15)
        (10 11 12 13)
        (8 18 19 9)
        (1 17 16 0)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
